export const officialBenefits = {
  title: "Мы предлагаем удобные условия сотрудничества и комплексный подход:",
  items: [
    {
      number: "1",
      title: 'Комплексное оформление с таможни "под ключ"',
      description: "Мы берем на себя всю бумажную работу.",
    },
    {
      number: "2",
      title: "Надежная доставка по отлаженному маршруту",
      description:
        "Вашим автомобилям гарантирована безопасная транспортировка.",
    },
    {
      number: "3",
      title: "Гибкие цены на контейнеры",
      description:
        "Мы стремимся предложить оптимальные условия для вашего бизнеса.",
    },
  ],
};
export const B2B = {
  title: "Почему стоит выбрать нас? Мы — лицензированная компания. Этот статус гарантирует вам:",
  items: [
    {
      number: "1",
      title: "Стопроцентную прозрачность всех процессов",
      description: "",
    },
    {
      number: "2",
      title: "Стопроцентную безопасность вашей поставки",
      description:
        "",
    },
    
  ],
};