export interface TableRow {
  category: string;
  price: string;
  delivery: string;
  note: string;
  hasCloseIcon?: boolean;
}

export const deliveryTables = {
  
  air: {
    tariffs: [
      {
        id: "kazakhstan",
        country: "Казахстан",

        columns: [
          "Категория",
          "Тариф, $ / кг",
          "Срок доставки*",
          "Другие регионы",
        ],

        rows: [
          {
            category: "Одежда, обувь, хозтовары, снеки",
            price: "4.5",
            delivery: "12–16 дней",
            note: "+1 $/кг к тарифу\n2–5 дней",
          },
          {
            category: "Косметика",
            price: "от 1.8 (в зависимости от веса)",
            delivery: "12–16 дней",
            note: "+1 $/кг к тарифу\n2–5 дней",
          },
          {
            category: "БАДы, витамины",
            price: "от 3",
            delivery: "12–16 дней",
            note: "+1 $/кг к тарифу\n2–5 дней",
          },
          {
            category: "Автозапчасти",
            price: "от 4",
            delivery: "12–16 дней",
            note: "+1 $/кг к тарифу\n2–5 дней",
          },
          {
            category: "Габаритный груз",
            price: "Объем / 5000",
            delivery: "12–16 дней",
            note: "+1 $/кг к тарифу\n2–5 дней",
          },
        ],

        notes: [
          "Минимальный вес: 10 кг",
          "Сроки указаны с момента выхода судна из Кореи",
          "Погрузки осуществляются еженедельно по четвергам.",
        ],
      },

      {
        id: "kyrgyzstan",
        country: "Кыргызстан",
         columns: [
          "Категория",
          "Тариф до Бишкека, $ / кг",
          "Срок доставки*",
          "Другие регионы",
        ],
         rows: [
           {
    category: "Одежда, косметика, обувь, хозтовары, снеки, витамины, автозапчасти",
    price: "12",
    delivery: "5–9 дней",
    note: "",
    hasCloseIcon: true,
  },
  

          {
            category: "Электроника (включая Dyson и другое)",
            price: "13",
            delivery: "5-9 дней",
            note: "",
    hasCloseIcon: true,
    },
  
        ],
        notes: [
          "Минимальный вес: 5 кг",
          "Доставка осуществляется до склада в Бишкеке",
          "Сроки указаны с момента вылета из Южной Кореи",
        ],
      },

      {
        id: "uzbekistan",
        country: "Узбекистан",
         columns: [
          "Категория",
          "Тариф до Ташкента, $ / кг",
          "Срок доставки*",
          "Другие регионы",
        ],
        rows: [
           {
            category: "Личные посылки (не более 3 одинаковых позицый одного наименования)",
            price: "9",
            delivery: "1-2 дня",
            note: "+1 $/кг",
          },
          {
            category: "Коммерческие грузы",
            price: "по запросу",
            delivery: "по запросу",
            note: "по запросу",
          },
        ],
        notes: [
          "Минимальный вес: 7 кг",
          "Доставка по Ташкенту - бесплатно",
          "Сроки указаны с момента вылета из Южной Кореи",
        ],
      },

      {
        id: "russia",
        country: "Россия",
        columns: [
          "Категория",
          "Тариф до Москвы, $ / кг",
          "Срок доставки*",
          "Другие регионы",
        ],
        rows: [
          {
            category: "Одежда, косметика, обувь, хозтовары, снеки, БАДы, витамины, автозапчасти",
            price: "16",
            delivery: "1-3 недели",
            note: "+2 $/кг к тарифу",
          },
          {
            category: "Медикаменты и косметология",
            price: "20",
            delivery: "2-3 недели",
            note: "+2 $/кг к тарифу",
          },
        ],
        notes: [
          "Минимальный вес: 5 кг",
          "Доставка до любого удобного пункта выдачи СДЭК",
          "Сроки указаны с момента вылета из Южной Кореи",
        ],
      },
    ],

    comparison: {
      title: "Какой способ доставки выбрать?",

      columns: [
        "",
        "Авиа",
        "Контейнер",
      ],

      rows: [
        {
          title: "Для чего",
          air: "Если груз нужен срочно — выбирайте авиа.",
          sea: "Если груз большой и нужно снизить стоимость.",
        },
        {
          title: "Скорость",
          air: "1–21 день",
          sea: "14–40 дней",
        },
        {
          title: "Тариф",
          air: "от 7.5 $/кг",
          sea: "от 3 $/кг",
        },
        {
          title: "Мин. вес",
          air: "от 5 кг",
          sea: "от 10 кг",
        },
        {
          title: "Идеально для",
          air: [
            "Интернет-магазинов",
            "Экспресс-посылок",
            "Одежды и электроники",
          ],
          sea: [
            "Мебели",
            "Автозапчастей",
            "Крупных партий",
          ],
        },
      ],
    },
  },

  sea: {
    tariffs: [],
    comparison: null,
  },

  cargo: {
    tariffs: [],
    comparison: null,
  },
};